
 function setup() { 
  createCanvas(800, 800); 
} 
 
function draw() { 
background(66, 170, 255)    //небо
noStroke()
fill(0,179,0)
rect(0,603,800,222)        //земля
fill(255)                  //облако
circle(600,300,70)  
circle(630,280,60)
circle(660,280,70)
circle(680,300,60)
circle(710,300, 70)
rect (600,300,110,35)
fill(46,151,0)             //ёлка
triangle(646,510, 676, 480, 706,510)
triangle(629,544, 676, 506, 720,544)
triangle (615,578, 676, 536, 734,578)
fill(97, 68,39)            
rect (666,578,20,25)
fill(128,128,128)          //гора  
triangle(250,603,450,360,600,603)
fill(97, 68,39)           //каньон
quad(150,603,50,603,100,800,200,800)
fill(247,242,26)
circle(450,700,25) //монеты
circle(430,740,25)  
circle(230,680,25)
}

